### Section 121.1: Basic Code to Import, Subset and Write External Data Files Using Pandas

In [1]:
import os
os.getcwd()

'E:\\MyFile\\Jupyter\\Python-Learn\\Chapter 121 Input, Subset and Output External Data Files using Pandas'

In [3]:
import pandas as pd
my_data = pd.read_csv("data.csv")
my_data

  Unnamed: 0  0    1
0          a  1  101
1          b  2  202
2          c  3  303

In [4]:
my_data.shape

(3, 3)

In [5]:
my_data.shape[0]

3

In [6]:
my_data.shape[1]

3

In [7]:
my_data[0:2]

  Unnamed: 0  0    1
0          a  1  101
1          b  2  202

In [8]:
my_data[1:3]

  Unnamed: 0  0    1
1          b  2  202
2          c  3  303

In [9]:
my_data[2:3]

  Unnamed: 0  0    1
2          c  3  303

In [10]:
my_data.iloc[0:2, 0:1]

  Unnamed: 0
0          a
1          b

In [12]:
my_data.loc[0, ['1', '2']]

1    101
2    NaN
Name: 0, dtype: object

In [13]:
my_data.loc[0:2, ['0', '1']]

   0    1
0  1  101
1  2  202
2  3  303

In [14]:
my_data2 = my_data.loc[0:2, ['0', '1']]
my_data2.to_csv('my.output.csv', index = 0)